Workspace_Task/.metadata/.plugins/org.eclipse.core.resources/.history/d9/70c2f08ba40f0010119c84577e95eaca

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
                  xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
                  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                  xmlns:tns="com.ghipss.gip"
                  targetNamespace="com.ghipss.gip">

    <wsdl:types>
        <xsd:schema targetNamespace="com.ghipss.gip">
            <xsd:element name="GIPTransactionOp">
                <xsd:complexType>
                    <xsd:sequence>
                        <xsd:element name="ReqGIPTransaction">
                            <xsd:complexType>
                                <xsd:sequence>
                                    <xsd:element name="Amount" type="xsd:string"/>
                                    <xsd:element name="datetime" type="xsd:string"/>
                                    <xsd:element name="TrackingNum" type="xsd:string"/>
                                    <xsd:element name="FunctionCode" type="xsd:string"/>
                                    <xsd:element name="OrigineBank" type="xsd:string"/>
                                    <xsd:element name="DestBank" type="xsd:string"/>
                                    <xsd:element name="SessionID" type="xsd:string"/>
                                    <xsd:element name="ChannelCode" type="xsd:string"/>
                                    <xsd:element name="AccountToDebit" type="xsd:string"/>
                                    <xsd:element name="NameToDebit" type="xsd:string"/>
                                    <xsd:element name="AccountToCredit" type="xsd:string"/>
                                    <xsd:element name="NameToCredit" type="xsd:string"/>
                                    <xsd:element name="Narration" type="xsd:string"/>
                                    <xsd:element name="Login" type="xsd:string"/>
                                    <xsd:element name="Password" type="xsd:string"/>
                                </xsd:sequence>
                            </xsd:complexType>
                        </xsd:element>
                    </xsd:sequence>
                </xsd:complexType>
            </xsd:element>
            
            <xsd:element name="GIPTransactionOpResponse">
                <xsd:complexType>
                    <xsd:sequence>
                        <xsd:element name="GIPTransactionResponse">
                            <xsd:complexType>
                                <xsd:sequence>
                                    <xsd:element name="Amount" type="xsd:string"/>
                                    <xsd:element name="datetime" type="xsd:string"/>
                                    <xsd:element name="TrackingNum" type="xsd:string"/>
                                    <xsd:element name="FunctionCode" type="xsd:string"/>
                                    <xsd:element name="OrigineBank" type="xsd:string"/>
                                    <xsd:element name="DestBank" type="xsd:string"/>
                                    <xsd:element name="SessionID" type="xsd:string"/>
                                    <xsd:element name="NameToDebit" type="xsd:string"/>
                                    <xsd:element name="AccountToDebit" type="xsd:string"/>
                                    <xsd:element name="NameToCredit" type="xsd:string"/>
                                    <xsd:element name="AccountToCredit" type="xsd:string"/>
                                    <xsd:element name="Narration" type="xsd:string"/>
                                    <xsd:element name="OneTimePassword" type="xsd:string" minOccurs="0" nillable="true"/>
                                    <xsd:element name="Login" type="xsd:string" minOccurs="0" nillable="true"/>
                                    <xsd:element name="Password" type="xsd:string" minOccurs="0" nillable="true"/>
                                    <xsd:element name="ActCode" type="xsd:string"/>
                                    <xsd:element name="AprvCode" type="xsd:string"/>
                                </xsd:sequence>
                            </xsd:complexType>
                        </xsd:element>
                    </xsd:sequence>
                </xsd:complexType>
            </xsd:element>
        </xsd:schema>
    </wsdl:types>

    <wsdl:message name="GIPTransactionOpRequest">
        <wsdl:part name="parameters" element="tns:GIPTransactionOp"/>
    </wsdl:message>
    <wsdl:message name="GIPTransactionOpResponse">
        <wsdl:part name="parameters" element="tns:GIPTransactionOpResponse"/>
    </wsdl:message>

    <wsdl:portType name="GIPTransactionPortType">
        <wsdl:operation name="GIPTransactionOp">
            <wsdl:input message="tns:GIPTransactionOpRequest"/>
            <wsdl:output message="tns:GIPTransactionOpResponse"/>
        </wsdl:operation>
    </wsdl:portType>

    <wsdl:binding name="GIPTransactionBinding" type="tns:GIPTransactionPortType">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="GIPTransactionOp">
            <soap:operation soapAction="com.ghipss.gip/GIPTransactionOp"/>
            <wsdl:input>
                <soap:body use="literal"/>
            </wsdl:input>
            <wsdl:output>
                <soap:body use="literal"/>
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>

    <wsdl:service name="GIPTransactionService">
        <wsdl:port name="GIPTransactionPort" binding="tns:GIPTransactionBinding">
            <soap:address location="http://your-endpoint-url/GIPTransactionService"/>
        </wsdl:port>
    </wsdl:service>
</wsdl:definitions>
